



Registration Protocols Extensions                              R. Carney
Internet-Draft                                              GoDaddy Inc.
Intended status: Standards Track                                G. Brown
Expires: September 6, 2018                          CentralNic Group plc
                                                               J. Frakes
                                                           March 5, 2018


 Registry Fee Extension for the Extensible Provisioning Protocol (EPP)
                     draft-ietf-regext-epp-fees-10

Abstract

   This document describes an Extensible Provisioning Protocol (EPP)
   extension mapping for registry fees.

Status of This Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at https://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on September 6, 2018.

Copyright Notice

   Copyright (c) 2018 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (https://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.




Carney, et al.          Expires September 6, 2018               [Page 1]

Internet-Draft           Registry Fee Extension               March 2018


Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3
     1.1.  Conventions Used in This Document . . . . . . . . . . . .   3
   2.  Migrating to Newer Versions of This Extension . . . . . . . .   4
   3.  Extension Elements  . . . . . . . . . . . . . . . . . . . . .   4
     3.1.  Client Commands . . . . . . . . . . . . . . . . . . . . .   4
     3.2.  Currency Codes  . . . . . . . . . . . . . . . . . . . . .   5
     3.3.  Validity Periods  . . . . . . . . . . . . . . . . . . . .   5
     3.4.  Fees and Credits  . . . . . . . . . . . . . . . . . . . .   5
       3.4.1.  Refunds . . . . . . . . . . . . . . . . . . . . . . .   6
       3.4.2.  Grace Periods . . . . . . . . . . . . . . . . . . . .   6
       3.4.3.  Correlation between Refundability and Grace Periods .   7
       3.4.4.  Applicability . . . . . . . . . . . . . . . . . . . .   7
     3.5.  Account Balance . . . . . . . . . . . . . . . . . . . . .   7
     3.6.  Credit Limit  . . . . . . . . . . . . . . . . . . . . . .   8
     3.7.  Classification of Objects . . . . . . . . . . . . . . . .   8
     3.8.  Phase and Subphase Attributes . . . . . . . . . . . . . .   8
     3.9.  Reason  . . . . . . . . . . . . . . . . . . . . . . . . .   9
   4.  Server Handling of Fee Information  . . . . . . . . . . . . .  10
   5.  EPP Command Mapping . . . . . . . . . . . . . . . . . . . . .  11
     5.1.  EPP Query Commands  . . . . . . . . . . . . . . . . . . .  11
       5.1.1.  EPP <check> Command . . . . . . . . . . . . . . . . .  11
       5.1.2.  EPP Transfer Query Command  . . . . . . . . . . . . .  15
     5.2.  EPP Transform Commands  . . . . . . . . . . . . . . . . .  17
       5.2.1.  EPP <create> Command  . . . . . . . . . . . . . . . .  17
       5.2.2.  EPP <delete> Command  . . . . . . . . . . . . . . . .  19
       5.2.3.  EPP <renew> Command . . . . . . . . . . . . . . . . .  20
       5.2.4.  EPP <transfer> Command  . . . . . . . . . . . . . . .  22
       5.2.5.  EPP <update> Command  . . . . . . . . . . . . . . . .  24
   6.  Formal Syntax . . . . . . . . . . . . . . . . . . . . . . . .  26
     6.1.  Fee Extension Schema  . . . . . . . . . . . . . . . . . .  26
   7.  Security Considerations . . . . . . . . . . . . . . . . . . .  31
   8.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .  31
     8.1.  XML Namespace . . . . . . . . . . . . . . . . . . . . . .  31
     8.2.  EPP Extension Registry  . . . . . . . . . . . . . . . . .  32
   9.  Implementation Status . . . . . . . . . . . . . . . . . . . .  32
     9.1.  RegistryEngine EPP Service  . . . . . . . . . . . . . . .  33
   10. Acknowledgements  . . . . . . . . . . . . . . . . . . . . . .  33
   11. Change History  . . . . . . . . . . . . . . . . . . . . . . .  34
     11.1.  Change from 09 to 10 . . . . . . . . . . . . . . . . . .  34
     11.2.  Change from 08 to 09 . . . . . . . . . . . . . . . . . .  34
     11.3.  Change from 07 to 08 . . . . . . . . . . . . . . . . . .  34
     11.4.  Change from 06 to 07 . . . . . . . . . . . . . . . . . .  34
     11.5.  Change from 05 to 06 . . . . . . . . . . . . . . . . . .  34
     11.6.  Change from 04 to 05 . . . . . . . . . . . . . . . . . .  34
     11.7.  Change from 03 to 04 . . . . . . . . . . . . . . . . . .  35
     11.8.  Change from 02 to 03 . . . . . . . . . . . . . . . . . .  35



Carney, et al.          Expires September 6, 2018               [Page 2]

Internet-Draft           Registry Fee Extension               March 2018


     11.9.  Change from 01 to 02 . . . . . . . . . . . . . . . . . .  35
     11.10. Change from 00 to 01 . . . . . . . . . . . . . . . . . .  35
     11.11. Change from draft-brown-00 to draft-ietf-regext-fees-00   36
   12. Normative References  . . . . . . . . . . . . . . . . . . . .  36
   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  36

1.  Introduction

   Historically, domain name registries have applied a simple fee
   structure for billable transactions, namely a basic unit price
   applied to domain <create>, <renew>, <transfer> and RGP [RFC3915]
   restore commands.  Given the relatively small number of EPP servers
   to which EPP clients have been required to connect, it has generally
   been the case that client operators have been able to obtain details
   of these fees out-of-band by contacting the server operators.

   Given the recent expansion of the DNS namespace, and the
   proliferation of novel business models, it is now desirable to
   provide a method for EPP clients to query EPP servers for the fees
   and credits associated with certain commands and specific objects.

   This document describes an extension mapping for version 1.0 of the
   Extensible Provisioning Protocol (EPP) [RFC5730].  This EPP mapping
   provides a mechanism by which EPP clients may query the fees and
   credits associated with various billable transactions, and obtain
   their current account balance.

1.1.  Conventions Used in This Document

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in RFC 2119 [RFC2119].

   XML is case sensitive.  Unless stated otherwise, XML specifications
   and examples provided in this document MUST be interpreted in the
   character case presented in order to develop a conforming
   implementation.

   "fee" is used as an abbreviation for "urn:ietf:params:xml:ns:fee-
   1.0".  The XML namespace prefix "fee" is used, but implementations
   MUST NOT depend on it and instead employ a proper namespace-aware XML
   parser and serializer to interpret and output the XML documents.

   In examples, "C:" represents lines sent by a protocol client and "S:"
   represents lines returned by a protocol server.  Indentation and
   white space in examples are provided only to illustrate element
   relationships and are not a REQUIRED feature of this protocol.




Carney, et al.          Expires September 6, 2018               [Page 3]

Internet-Draft           Registry Fee Extension               March 2018


2.  Migrating to Newer Versions of This Extension

   (Note to RFC Editor: remove this section before publication as an
   RFC.)

   Servers which implement this extension SHOULD provide a way for
   clients to progressively update their implementations when a new
   version of the extension is deployed.

   Servers SHOULD (for a temporary migration period) provide support for
   older versions of the extension in parallel to the newest version,
   and allow clients to select their preferred version via the
   <svcExtension> element of the <login> command.

   If a client requests multiple versions of the extension at login,
   then, when preparing responses to commands which do not include
   extension elements, the server SHOULD only include extension elements
   in the namespace of the newest version of the extension requested by
   the client.

   When preparing responses to commands which do include extension
   elements, the server SHOULD only include extension elements for the
   extension versions present in the command.

3.  Extension Elements

3.1.  Client Commands

   The <fee:command> element is used in the EPP <check> command to
   determine the fee which is applicable to the given command.

   The use of the <fee:command> keys off the use of the "name" attribute
   to define which transform fees the client is requesting information
   about.  Here is the list of possible values for the "name" attribute:

   o  "create" indicating a <create> command as defined in [RFC5730];
   o  "delete" indicating a <delete> command as defined in [RFC5730];
   o  "renew" indicating a <renew> command as defined in [RFC5730];
   o  "update" indicating a <update> command as defined in [RFC5730];
   o  "transfer" indicating a <transfer> command as defined in
      [RFC5730];
   o  If the server supports the Registry Grace Period Mapping
      [RFC3915], then the server MUST also support the "restore" value
      as defined in [RFC3915];
   o  "custom" indicating a custom command that uses the "customName"
      attribute to define the custom operation.





Carney, et al.          Expires September 6, 2018               [Page 4]

Internet-Draft           Registry Fee Extension               March 2018


   The <fee:command> element MAY have an OPTIONAL "phase" attribute
   specifying a launch phase as described in [RFC8334].  It may also
   contain an OPTIONAL "subphase" attribute identifying the custom or
   sub-phase as described in [RFC8334].

3.2.  Currency Codes

   The <fee:currency> element is used to indicate which currency fees
   are charged in.  This value of this element MUST be a three-character
   currency code from [ISO4217].

   Note that ISO 4217 provides the special "XXX" code, which MAY be used
   if the server uses a non-currency based system for assessing fees,
   such as a system of credits.

   The use of <fee:currency> elements in client commands is OPTIONAL: if
   a <fee:currency> element is not present in a command, the server MUST
   determine the currency based on the server default currency or based
   on the client's account settings which are agreed to by the client
   and server via an out-of-band channel.  However, the <fee:currency>
   element MUST be present in responses.

   Servers SHOULD NOT perform a currency conversion if a client uses an
   incorrect currency code.  Servers SHOULD return a 2004 "Parameter
   value range" error instead.

3.3.  Validity Periods

   When querying for fee information using the <check> command, the
   <fee:period> element is used to indicate the units to be added to the
   registration period of objects by the <create>, <renew> and
   <transfer> commands.  This element is derived from the
   <domain:period> element described in [RFC5731].

   The <fee:period> element is OPTIONAL in <check> commands, if omitted,
   the server MUST determine the fee(s) using the server default period.
   The <fee:period> element MUST be present in <check> responses.

3.4.  Fees and Credits

   Servers which implement this extension will include elements in
   responses which provide information about the fees and/or credits
   associated with a given billable transaction.

   The <fee:fee> and <fee:credit> elements are used to provide this
   information.  The presence of a <fee:fee> element in a response
   indicates a debit against the client's account balance; a
   <fee:credit> element indicates a credit.  A <fee:fee> element MUST



Carney, et al.          Expires September 6, 2018               [Page 5]

Internet-Draft           Registry Fee Extension               March 2018


   have a non-negative value.  A <fee:credit> element MUST have a
   negative value.

   A server MAY respond with multiple <fee:fee> and <fee:credit>
   elements in the same response.  In such cases, the net fee or credit
   applicable to the transaction is the arithmetic sum of the values of
   each of the <fee:fee> and/or <fee:credit> elements.  This amount
   applies to the total additional validity period applied to the object
   (where applicable) rather than to any incremental unit.

   The following attributes are defined for the <fee:fee> element.
   These are described in detail below:

   description: an OPTIONAL attribute which provides a human-readable
   description of the fee.  Servers should provide documentation on the
   possible values of this attribute, and their meanings.

   refundable: an OPTIONAL boolean attribute indicating whether the fee
   is refundable if the object is deleted.

   grace-period: an OPTIONAL attribute which provides the time period
   during which the fee is refundable.

   applied: an OPTIONAL attribute indicating when the fee will be
   deducted from the client's account.

   The <fee:credit> element can take a "description" attribute as
   described above.  No other attributes are defined for this element.

3.4.1.  Refunds

   <fee:fee> elements MAY have an OPTIONAL "refundable" attribute which
   takes a boolean value.  Fees may be refunded under certain
   circumstances, such as when a domain application is rejected (as
   described in [RFC8334]) or when an object is deleted during the
   relevant Grace Period (see below).

   If the "refundable" attribute is omitted, then clients SHOULD NOT
   make any assumption about the refundability of the fee.

3.4.2.  Grace Periods

   [RFC3915] describes a system of "grace periods", which are time
   periods following a billable transaction during which, if an object
   is deleted, the client receives a refund.

   The "grace-period" attribute MAY be used to indicate the relevant
   grace period for a fee.  If a server implements the Registry Grace



Carney, et al.          Expires September 6, 2018               [Page 6]

Internet-Draft           Registry Fee Extension               March 2018


   Period extension [RFC3915], it MUST specify the grace period for all
   relevant transactions.

   If the "grace-period" attribute is omitted, then clients SHOULD NOT
   make any assumption about the grace period of the fee.

3.4.3.  Correlation between Refundability and Grace Periods

   If a <fee:fee> element has a "grace-period" attribute then it MUST
   also be refundable.  If the "refundable" attribute of a <fee:fee>
   element is false then it MUST NOT have a "grace-period" attribute.

3.4.4.  Applicability

   Fees may be applied immediately upon receipt of a command from a
   client, or may only be applied once an out-of-band process (such as
   the processing of applications at the end of a launch phase) has
   taken place.

   The "applied" attribute of the <fee:fee> element allows servers to
   indicate whether a fee will be applied immediately, or whether it
   will be applied at some point in the future.  This attribute takes
   two possible values: "immediate" or "delayed".

3.5.  Account Balance

   The <fee:balance> element is an OPTIONAL element which MAY be
   included in server responses to transform commands.  If present, it
   can be used by the client to determine the remaining credit at the
   server.

   Whether or not the <fee:balance> is included in responses is a matter
   of server policy.  However, if a server chooses to offer support for
   this element, it MUST be included in responses to all "transform" or
   billable commands (e.g. <create>, <renew>, <update>, <delete>,
   <transfer op="request">).

   The value of the <fee:balance> MAY be negative.  A negative balance
   indicates that the server has extended a line of credit to the client
   (see below).

   If a server includes a <fee:balance> element in response to transform
   commands, the value of the element MUST reflect the client's account
   balance after any fees or credits associated with that command have
   been applied.






Carney, et al.          Expires September 6, 2018               [Page 7]

Internet-Draft           Registry Fee Extension               March 2018


3.6.  Credit Limit

   As described above, if a server returns a response containing a
   <fee:balance> with a negative value, then the server has extended a
   line of credit to the client.  A server MAY also include a
   <fee:creditLimit> element in responses which indicates the maximum
   credit available to a client.  A server MAY reject certain
   transactions if the absolute value of the <fee:balance> is equal to
   or exceeds the value of the <fee:creditLimit> element.

   Whether or not the <fee:creditLimit> is included in responses is a
   matter of server policy.  However, if a server chooses to offer
   support for this element, it MUST be included in responses to all
   "transform" commands (e.g. <create>, <renew>, <update>, <delete>,
   <transfer op="request">).

3.7.  Classification of Objects

   Objects may be assigned to a particular class, category, or tier,
   each of which has a particular fee or set of fees associated with it.
   The <fee:class> element, which MAY appear in <check> and transform
   responses, is used to indicate the classification of an object.

   If a server makes use of this element, it should provide clients with
   a list of all the values that the element may take via an out-of-band
   channel.  Servers MUST NOT use values which do not appear on this
   list.

   Servers which make use of this element MUST use a <fee:class> element
   with the value "standard" for all objects that are subject to the
   standard or default fee.

3.8.  Phase and Subphase Attributes

   The <fee:command> element has two attributes, phase and subphase,
   that provide additional information related to a specific launch
   phase as described in [RFC8334].  These attributes are used as
   filters that should refine the server processing.

   If the client <fee:command> contains a server supported combination
   of phase/subphase the server MUST return fee data (including the
   phase/subphase attribute(s)) for the specific combination.

   If the client <fee:command> contains no phase/subphase attributes and
   the server has only one active phase/subphase combination the server
   MUST return data (including the phase/subphase attribute(s)) of the
   currently active phase/subphase.




Carney, et al.          Expires September 6, 2018               [Page 8]

Internet-Draft           Registry Fee Extension               March 2018


   If the client <fee:command> contains no phase/subphase attributes and
   the server has more than one active phase/subphase combination the
   server MUST respond with a 2003 "Required parameter missing" error.

   If the client <fee:command> contains no phase/subphase attributes and
   the server is currently in a "quiet period" (e.g. not accepting
   registrations or applications)the server MUST return data consistent
   with the default general availability phase (e.g. "open" or "claims")
   including the appropriate phase/subphase attribute(s).

   If the client <fee:command> contains a phase attribute with no
   subphase and the server has only one active subphase (or no subphase)
   of this phase, the server MUST return data (including the phase/
   subphase attribute(s)) of the provided phase and currently active
   subphase.

   If the client <fee:command> contains a phase attribute with no
   subphase and the server has more than one active subphase combination
   of this phase, the server MUST respond with a 2003 "Required
   parameter missing" error.

   If the client <fee:command> contains a subphase with no phase
   attribute the server MUST respond with a 2003 "Required parameter
   missing" error.

   If the client <fee:command> contains a phase attribute not defined in
   [RFC8334] or not supported by server the server MUST respond with a
   2004 "Parameter value range" error.

   If the client <fee:command> contains a subphase attribute (or phase/
   subphase combination) not supported by server the server MUST respond
   with a 2004 "Parameter value range" error.

3.9.  Reason

   The <fee:reason> element is used to provide server specific text in
   an effort to better explain why a <check> command did not complete as
   the client expected.  An OPTIONAL "lang" attribute MAY be present to
   identify the language of the returned text and has a default value of
   "en" (English).

   The <fee:reason> element can be used within the server response
   <fee:command> element or within the <fee:cd> element.

   If the server cannot calculate the relevant fees, because the object,
   command, currency, period, class or some combination is invalid per
   server policy, the server has two ways of handling error processing
   of <fee:command> element(s):



Carney, et al.          Expires September 6, 2018               [Page 9]

Internet-Draft           Registry Fee Extension               March 2018


   1.  Fast-fail - The server, upon error identification, MAY stop
       processing <fee:command> elements and return to the client a
       <fee:cd> containing the <fee:objID> and a <fee:reason> element
       detailing the reason for failure.

       S: <fee:cd avail="0">
       S:   <fee:objID>example.xyz</fee:objID>
       S:   <fee:reason>Only 1 year registration periods are
       S:   valid.</fee:reason>
       S: </fee:cd>

   2.  Partial-fail - The server, upon error identification, MAY
       continue processing <fee:command> elements and return to the
       client a <fee:cd> containing successfully processed <fee:command>
       elements and failed <fee:command> elements.  All returned failed
       <fee:command> elements that MUST have a <fee:reason> element
       detailing the reason for failure, and the server MAY additionally
       include a <fee:reason> element at the <fee:cd> level.

       S: <fee:cd avail="0">
       S:   <fee:objID>example.xyz</fee:objID>
       S:   <fee:command name="create">
       S:     <fee:period unit="y">2</fee:period>
       S:     <fee:reason>Only 1 year registration periods are
       S:     valid.</fee:reason>
       S:   </fee:command>
       S: </fee:cd>


   In either failure scenario the server MUST set the <fee:cd> avail
   attribute to false (0) and the server MUST process all domain names
   in the client request.

4.  Server Handling of Fee Information

   Depending on server policy, a client MAY be required to include the
   extension elements described in this document for certain transform
   commands.  Servers must provide clear documentation to clients about
   the circumstances in which this extension must be used.

   The server MUST return avail="0" in its response to a <check> command
   for any domain name in the <check> command that does not include the
   <fee:check> extension for which the server would likewise fail a
   domain <create> command when no <fee> extension is provided for that
   same domain object.

   If a server receives a <check> command from a client, which results
   in no possible fee combination but where a fee is required, the



Carney, et al.          Expires September 6, 2018              [Page 10]

Internet-Draft           Registry Fee Extension               March 2018


   server MUST set the "avail" attribute of the <fee:cd> element to
   false and provide a <fee:reason>.

   If a server receives a <check> command from a client, which results
   in an ambiguous result (i.e. multiple possible fee combinations) the
   server MUST reject the command with a 2003 "Required parameter
   missing" error.

   If a server receives a command from a client, which does not include
   the fee extension data elements required by the server for that
   command, then the server MUST respond with a 2003 "Required parameter
   missing" error.

   If the currency or total fee provided by the client is less than the
   server's own calculation of the fee for that command, then the server
   MUST reject the command with a 2004 "Parameter value range" error.

5.  EPP Command Mapping

   A detailed description of the EPP syntax and semantics can be found
   in [RFC5730].

5.1.  EPP Query Commands

   This extension does not add any elements to the EPP <poll> or <info>
   commands or responses.

5.1.1.  EPP <check> Command

   This extension defines a new command called the Fee Check Command
   that defines additional elements for the EPP <check> command to
   provide fee information along with the availability information of
   the EPP <check> command.

   The command MAY contain an <extension> element which MAY contain a
   <fee:check> element.  The <fee:check> element MAY contain one
   <fee:currency> element and MUST contain one or more <fee:command>
   elements.

   The <fee:command> element(s) contain(s) a "name" attribute (see
   Section 3.1), an OPTIONAL "standard" attribute with a default value
   of false (0), an OPTIONAL "phase" attribute, and an OPTIONAL
   "subphase" attribute (see Section 3.8).  The <fee:command> element(s)
   MAY have the following child elements:

   o  An OPTIONAL <fee:period> element (as described in Section 3.3).





Carney, et al.          Expires September 6, 2018              [Page 11]

Internet-Draft           Registry Fee Extension               March 2018


   Example <check> command:

   C: <?xml version="1.0" encoding="utf-8" standalone="no"?>
   C: <epp xmlns="urn:ietf:params:xml:ns:epp-1.0">
   C:   <command>
   C:     <check>
   C:       <domain:check
   C:         xmlns:domain="urn:ietf:params:xml:ns:domain-1.0">
   C:         <domain:name>example.com</domain:name>
   C:         <domain:name>example.net</domain:name>
   C:         <domain:name>example.xyz</domain:name>
   C:       </domain:check>
   C:     </check>
   C:     <extension>
   C:       <fee:check xmlns:fee="urn:ietf:params:xml:ns:fee-1.0">
   C:         <fee:currency>USD</fee:currency>
   C:         <fee:command name="create">
   C:           <fee:period unit="y">2</fee:period>
   C:         </fee:command>
   C:         <fee:command name="renew"/>
   C:         <fee:command name="transfer"/>
   C:         <fee:command name="restore"/>
   C:       </fee:check>
   C:     </extension>
   C:     <clTRID>ABC-12345</clTRID>
   C:   </command>
   C: </epp>

   When the server receives a <check> command that includes the
   extension elements described above, its response MUST contain an
   <extension> element, which MUST contain a child <fee:chkData>
   element.  The <fee:chkData> element MUST contain a <fee:currency>
   element and a <fee:cd> for each element referenced in the client
   <check> command.

   Each <fee:cd> element MUST contain the following child elements:

   o  A <fee:objID> element, which MUST match an element referenced in
      the client <check> command.
   o  An OPTIONAL <fee:class> element (as described in Section 3.7).
   o  A <fee:command> element matching each <fee:command> (unless the
      "avail" attribute of the <fee:cd> if false) that appeared in the
      corresponding <fee:check> of the client command.  This element MAY
      have the OPTIONAL "phase" and "subphase" attributes, which SHOULD
      match the same attributes in the corresponding <fee:command>
      element of the client command if sent by the client.





Carney, et al.          Expires September 6, 2018              [Page 12]

Internet-Draft           Registry Fee Extension               March 2018


   The <fee:cd> element also has an OPTIONAL "avail" attribute which is
   a boolean.  If the value of this attribute evaluates to false, this
   indicates that the server cannot calculate the relevant fees, because
   the object, command, currency, period, class or some combination is
   invalid per server policy.  If "avail" is false then the <fee:cd> or
   the <fee:command> element MUST contain a <fee:reason> element (as
   described in Section 3.9) and the server MAY eliminate some or all of
   the <fee:command> element(s).

   The <fee:command> element(s) MAY have the following child elements:

   o  An OPTIONAL <fee:period> element (as described in Section 3.3),
      which contains the same unit that appeared in the <fee:period>
      element of the command.  If the value of the preceding
      <fee:command> element is "restore", this element MUST NOT be
      included, otherwise it MUST be included.  If no <fee:period>
      appeared in the client command (and the command is not "restore")
      then the server MUST return its default period value.
   o  Zero or more <fee:fee> elements (as described in Section 3.4).
   o  Zero or more <fee:credit> elements (as described in Section 3.4).
   o  An OPTIONAL <fee:reason> element (as described in Section 3.9).

   If the "avail" attribute of the <fee:cd> element is true and if no
   <fee:fee> elements are present in a <fee:command> element, this
   indicates that no fee will be assessed by the server for this
   command.

   If the "avail" attribute is true, then the <fee:command> element MUST
   NOT contain a <fee:reason> element.

   Example <check> response:

   S: <?xml version="1.0" encoding="utf-8" standalone="no"?>
   S: <epp xmlns="urn:ietf:params:xml:ns:epp-1.0">
   S:   <response>
   S:     <result code="1000">
   S:       <msg>Command completed successfully</msg>
   S:     </result>
   S:     <resData>
   S:       <domain:chkData
   S:         xmlns:domain="urn:ietf:params:xml:ns:domain-1.0">
   S:         <domain:cd>
   S:           <domain:name avail="1">example.com</domain:name>
   S:         </domain:cd>
   S:         <domain:cd>
   S:           <domain:name avail="1">example.net</domain:name>
   S:         </domain:cd>
   S:         <domain:cd>



Carney, et al.          Expires September 6, 2018              [Page 13]

Internet-Draft           Registry Fee Extension               March 2018


   S:           <domain:name avail="1">example.xyz</domain:name>
   S:         </domain:cd>
   S:       </domain:chkData>
   S:     </resData>
   S:     <extension>
   S:       <fee:chkData
   S:           xmlns:fee="urn:ietf:params:xml:ns:fee-1.0">
   S:         <fee:currency>USD</fee:currency>
   S:         <fee:cd avail="1">
   S:           <fee:objID>example.com</fee:objID>
   S:           <fee:class>Premium</fee:class>
   S:           <fee:command name="create">
   S:             <fee:period unit="y">2</fee:period>
   S:             <fee:fee
   S:               description="Registration Fee"
   S:               refundable="1"
   S:               grace-period="P5D">10.00</fee:fee>
   S:           </fee:command>
   S:           <fee:command name="renew">
   S:             <fee:period unit="y">1</fee:period>
   S:             <fee:fee
   S:               description="Renewal Fee"
   S:               refundable="1"
   S:               grace-period="P5D">5.00</fee:fee>
   S:           </fee:command>
   S:           <fee:command name="transfer">
   S:             <fee:period unit="y">1</fee:period>
   S:             <fee:fee
   S:               description="Transfer Fee"
   S:               refundable="1"
   S:               grace-period="P5D">5.00</fee:fee>
   S:           </fee:command>
   S:           <fee:command name="restore">
   S:             <fee:fee
   S:               description="Redemption Fee">5.00</fee:fee>
   S:           </fee:command>
   S:         </fee:cd>
   S:         <fee:cd avail="1">
   S:           <fee:objID>example.net</fee:objID>
   S:           <fee:command name="create">
   S:             <fee:period unit="y">2</fee:period>
   S:             <fee:fee
   S:               description="Registration Fee"
   S:               refundable="1"
   S:               grace-period="P5D">10.00</fee:fee>
   S:           </fee:command>
   S:           <fee:command name="renew">
   S:             <fee:period unit="y">1</fee:period>



Carney, et al.          Expires September 6, 2018              [Page 14]

Internet-Draft           Registry Fee Extension               March 2018


   S:             <fee:fee
   S:               description="Renewal Fee"
   S:               refundable="1"
   S:               grace-period="P5D">5.00</fee:fee>
   S:           </fee:command>
   S:           <fee:command name="transfer">
   S:             <fee:period unit="y">1</fee:period>
   S:             <fee:fee
   S:               description="Transfer Fee"
   S:               refundable="1"
   S:               grace-period="P5D">5.00</fee:fee>
   S:           </fee:command>
   S:           <fee:command name="restore">
   S:             <fee:fee
   S:               description="Redemption Fee">5.00</fee:fee>
   S:           </fee:command>
   S:         </fee:cd>
   S:         <fee:cd avail="0">
   S:           <fee:objID>example.xyz</fee:objID>
   S:           <fee:command name="create">
   S:             <fee:period unit="y">2</fee:period>
   S:             <fee:reason>Only 1 year registration periods are
   S:               valid.</fee:reason>
   S:           </fee:command>
   S:         </fee:cd>
   S:       </fee:chkData>
   S:     </extension>
   S:     <trID>
   S:       <clTRID>ABC-12345</clTRID>
   S:       <svTRID>54322-XYZ</svTRID>
   S:     </trID>
   S:   </response>
   S: </epp>

5.1.2.  EPP Transfer Query Command

   This extension does not add any elements to the EPP <transfer> query
   command, but does include elements in the response, when the
   extension is included in the <login> command service extensions.

   When the <transfer> query command has been processed successfully,
   the client included the extension in the <login> command service
   extensions, and the client is authorized by the server to view
   information about the transfer, the server MAY include in the
   <extension> section of the EPP response a <fee:trnData> element,
   which contains the following child elements:

   o  A <fee:currency> element (as described in Section 3.2).



Carney, et al.          Expires September 6, 2018              [Page 15]

Internet-Draft           Registry Fee Extension               March 2018


   o  A <fee:period> element (as described in Section 3.3).
   o  Zero or more <fee:fee> elements (as described in Section 3.4)
      containing the fees that will be charged to the gaining client.
   o  Zero or more <fee:credit> elements (as described in Section 3.4)
      containing the credits that will be refunded to the losing client.

   Servers SHOULD omit <fee:credit> when returning a response to the
   gaining client, and omit <fee:fee> elements when returning a response
   to the losing client.

   If no <fee:trnData> element is included in the response, then no fee
   will be assessed by the server for the transfer.

   Example <transfer> query response:

   S: <?xml version="1.0" encoding="utf-8" standalone="no"?>
   S: <epp xmlns="urn:ietf:params:xml:ns:epp-1.0">
   S:   <response>
   S:     <result code="1001">
   S:       <msg>Command completed successfully; action pending</msg>
   S:     </result>
   S:     <resData>
   S:       <domain:trnData
   S:         xmlns:domain="urn:ietf:params:xml:ns:domain-1.0">
   S:         <domain:name>example.com</domain:name>
   S:         <domain:trStatus>pending</domain:trStatus>
   S:         <domain:reID>ClientX</domain:reID>
   S:         <domain:reDate>2000-06-08T22:00:00.0Z</domain:reDate>
   S:         <domain:acID>ClientY</domain:acID>
   S:         <domain:acDate>2000-06-13T22:00:00.0Z</domain:acDate>
   S:         <domain:exDate>2002-09-08T22:00:00.0Z</domain:exDate>
   S:       </domain:trnData>
   S:     </resData>
   S:     <extension>
   S:       <fee:trnData xmlns:fee="urn:ietf:params:xml:ns:fee-1.0">
   S:         <fee:currency>USD</fee:currency>
   S:         <fee:period unit="y">1</fee:period>
   S:         <fee:fee>5.00</fee:fee>
   S:       </fee:trnData>
   S:     </extension>
   S:     <trID>
   S:       <clTRID>ABC-12345</clTRID>
   S:       <svTRID>54322-XYZ</svTRID>
   S:     </trID>
   S:   </response>
   S: </epp>





Carney, et al.          Expires September 6, 2018              [Page 16]

Internet-Draft           Registry Fee Extension               March 2018


5.2.  EPP Transform Commands

5.2.1.  EPP <create> Command

   This extension adds elements to both the EPP <create> command and
   response, when the extension is included in the <login> command
   service extensions.

   When submitting a <create> command to the server, the client MAY
   include in the <extension> element a <fee:create> element which
   includes the following child elements:

   o  An OPTIONAL <fee:currency> element (as described in Section 3.2);
   o  One or more <fee:fee> elements (as described in Section 3.4).

   The server MUST fail the <create> command if the <fee:fee> provided
   by the client is less than the server fee.

   When the <create> command has been processed successfully, and the
   client included the extension in the <login> command service
   extensions, and a fee was assessed by the server for the transaction,
   the server MUST include in the <extension> section of the EPP
   response a <fee:creData> element, which contains the following child
   elements:

   o  A <fee:currency> element (as described in Section 3.2);
   o  Zero or more <fee:fee> elements (as described in Section 3.4);
   o  Zero or more <fee:credit> elements (as described in Section 3.4);
   o  An OPTIONAL <fee:balance> element (as described in Section 3.5);
   o  An OPTIONAL <fee:creditLimit> element (as described in
      Section 3.6).




















Carney, et al.          Expires September 6, 2018              [Page 17]

Internet-Draft           Registry Fee Extension               March 2018


   Example <create> command:

   C: <?xml version="1.0" encoding="utf-8" standalone="no"?>
   C: <epp xmlns="urn:ietf:params:xml:ns:epp-1.0">
   C:   <command>
   C:     <create>
   C:       <domain:create
   C:         xmlns:domain="urn:ietf:params:xml:ns:domain-1.0">
   C:         <domain:name>example.com</domain:name>
   C:         <domain:period unit="y">2</domain:period>
   C:         <domain:ns>
   C:           <domain:hostObj>ns1.example.net</domain:hostObj>
   C:           <domain:hostObj>ns2.example.net</domain:hostObj>
   C:         </domain:ns>
   C:         <domain:registrant>jd1234</domain:registrant>
   C:         <domain:contact type="admin">sh8013</domain:contact>
   C:         <domain:contact type="tech">sh8013</domain:contact>
   C:         <domain:authInfo>
   C:           <domain:pw>2fooBAR</domain:pw>
   C:         </domain:authInfo>
   C:       </domain:create>
   C:     </create>
   C:     <extension>
   C:       <fee:create xmlns:fee="urn:ietf:params:xml:ns:fee-1.0">
   C:         <fee:currency>USD</fee:currency>
   C:         <fee:fee>5.00</fee:fee>
   C:       </fee:create>
   C:     </extension>
   C:     <clTRID>ABC-12345</clTRID>
   C:   </command>
   C: </epp>




















Carney, et al.          Expires September 6, 2018              [Page 18]

Internet-Draft           Registry Fee Extension               March 2018


   Example <create> response:

   S: <?xml version="1.0" encoding="utf-8" standalone="no"?>
   S: <epp xmlns="urn:ietf:params:xml:ns:epp-1.0">
   S:   <response>
   S:     <result code="1000">
   S:       <msg>Command completed successfully</msg>
   S:     </result>
   S:     <resData>
   S:       <domain:creData
   S:         xmlns:domain="urn:ietf:params:xml:ns:domain-1.0">
   S:         <domain:name>example.com</domain:name>
   S:         <domain:crDate>1999-04-03T22:00:00.0Z</domain:crDate>
   S:         <domain:exDate>2001-04-03T22:00:00.0Z</domain:exDate>
   S:       </domain:creData>
   S:     </resData>
   S:     <extension>
   S:       <fee:creData xmlns:fee="urn:ietf:params:xml:ns:fee-1.0">
   S:         <fee:currency>USD</fee:currency>
   S:         <fee:fee
   S:           description="Registration Fee"
   S:           refundable="1"
   S:           grace-period="P5D">5.00</fee:fee>
   S:         <fee:balance>-5.00</fee:balance>
   S:         <fee:creditLimit>1000.00</fee:creditLimit>
   S:       </fee:creData>
   S:     </extension>
   S:     <trID>
   S:       <clTRID>ABC-12345</clTRID>
   S:       <svTRID>54321-XYZ</svTRID>
   S:     </trID>
   S:   </response>
   S: </epp>

5.2.2.  EPP <delete> Command

   This extension does not add any elements to the EPP <delete> command,
   but does include elements in the response, when the extension is
   included in the <login> command service extensions.

   When the <delete> command has been processed successfully, and the
   client included the extension in the <login> command service
   extensions, the server MAY include in the <extension> section of the
   EPP response a <fee:delData> element, which contains the following
   child elements:

   o  A <fee:currency> element (as described in Section 3.2);
   o  Zero or more <fee:fee> elements (as described in Section 3.4);



Carney, et al.          Expires September 6, 2018              [Page 19]

Internet-Draft           Registry Fee Extension               March 2018


   o  Zero or more <fee:credit> elements (as described in Section 3.4);
   o  An OPTIONAL <fee:balance> element (as described in Section 3.5);
   o  An OPTIONAL <fee:creditLimit> element (as described in
      Section 3.6).

   Example <delete> response:

   S: <?xml version="1.0" encoding="utf-8" standalone="no"?>
   S: <epp xmlns="urn:ietf:params:xml:ns:epp-1.0">
   S:   <response>
   S:     <result code="1000">
   S:       <msg>Command completed successfully</msg>
   S:     </result>
   S:     <extension>
   S:       <fee:delData
   S:         xmlns:fee="urn:ietf:params:xml:ns:fee-1.0">
   S:         <fee:currency>USD</fee:currency>
   S:         <fee:credit description="AGP Credit">-5.00</fee:credit>
   S:         <fee:balance>1005.00</fee:balance>
   S:       </fee:delData>
   S:     </extension>
   S:     <trID>
   S:       <clTRID>ABC-12345</clTRID>
   S:       <svTRID>54321-XYZ</svTRID>
   S:     </trID>
   S:   </response>
   S: </epp>

5.2.3.  EPP <renew> Command

   This extension adds elements to both the EPP <renew> command and
   response, when the extension is included in the <login> command
   service extensions.

   When submitting a <renew> command to the server, the client MAY
   include in the <extension> element a <fee:renew> element which
   includes the following child elements:

   o  An OPTIONAL <fee:currency> element (as described in Section 3.2);
   o  One or more <fee:fee> elements (as described in Section 3.4).

   When the <renew> command has been processed successfully, and the
   client included the extension in the <login> command service
   extensions, the server MAY include in the <extension> section of the
   EPP response a <fee:renData> element, which contains the following
   child elements:

   o  A <fee:currency> element (as described in Section 3.2);



Carney, et al.          Expires September 6, 2018              [Page 20]

Internet-Draft           Registry Fee Extension               March 2018


   o  Zero or more <fee:fee> elements (as described in Section 3.4);
   o  Zero or more <fee:credit> elements (as described in Section 3.4);
   o  An OPTIONAL <fee:balance> element (as described in Section 3.5);
   o  An OPTIONAL <fee:creditLimit> element (as described in
      Section 3.6).

   Example <renew> command:

   C: <?xml version="1.0" encoding="utf-8" standalone="no"?>
   C: <epp xmlns="urn:ietf:params:xml:ns:epp-1.0">
   C:   <command>
   C:     <renew>
   C:       <domain:renew
   C:         xmlns:domain="urn:ietf:params:xml:ns:domain-1.0">
   C:         <domain:name>example.com</domain:name>
   C:         <domain:curExpDate>2000-04-03</domain:curExpDate>
   C:         <domain:period unit="y">5</domain:period>
   C:       </domain:renew>
   C:     </renew>
   C:     <extension>
   C:       <fee:renew xmlns:fee="urn:ietf:params:xml:ns:fee-1.0">
   C:         <fee:currency>USD</fee:currency>
   C:         <fee:fee>5.00</fee:fee>
   C:       </fee:renew>
   C:     </extension>
   C:     <clTRID>ABC-12345</clTRID>
   C:   </command>
   C: </epp>























Carney, et al.          Expires September 6, 2018              [Page 21]

Internet-Draft           Registry Fee Extension               March 2018


   Example <renew> response:

   S: <?xml version="1.0" encoding="utf-8" standalone="no"?>
   S: <epp xmlns="urn:ietf:params:xml:ns:epp-1.0">
   S:   <response>
   S:     <result code="1000">
   S:       <msg>Command completed successfully</msg>
   S:     </result>
   S:     <resData>
   S:       <domain:renData
   S:         xmlns:domain="urn:ietf:params:xml:ns:domain-1.0">
   S:         <domain:name>example.com</domain:name>
   S:         <domain:exDate>2005-04-03T22:00:00.0Z</domain:exDate>
   S:       </domain:renData>
   S:     </resData>
   S:     <extension>
   S:       <fee:renData xmlns:fee="urn:ietf:params:xml:ns:fee-1.0">
   S:         <fee:currency>USD</fee:currency>
   S:         <fee:fee
   S:           refundable="1"
   S:           grace-period="P5D">5.00</fee:fee>
   S:         <fee:balance>1000.00</fee:balance>
   S:       </fee:renData>
   S:     </extension>
   S:     <trID>
   S:       <clTRID>ABC-12345</clTRID>
   S:       <svTRID>54322-XYZ</svTRID>
   S:     </trID>
   S:   </response>
   S: </epp>

5.2.4.  EPP <transfer> Command

   This extension adds elements to both the EPP <transfer> command and
   response, when the value of the "op" attribute of the <transfer>
   command element is "request", and the extension is included in the
   <login> command service extensions.

   When submitting a <transfer> command to the server, the client MAY
   include in the <extension> element a <fee:transfer> element which
   includes the following child elements:

   o  An OPTIONAL <fee:currency> element (as described in Section 3.2);
   o  One or more <fee:fee> elements (as described in Section 3.4).

   When the <transfer> command has been processed successfully, and the
   client included the extension in the <login> command service
   extensions, the server MAY include in the <extension> section of the



Carney, et al.          Expires September 6, 2018              [Page 22]

Internet-Draft           Registry Fee Extension               March 2018


   EPP response a <fee:trnData> element, which contains the following
   child elements:

   o  A <fee:currency> element (as described in Section 3.2);
   o  Zero or more <fee:fee> elements (as described in Section 3.4);
   o  Zero or more <fee:credit> elements (as described in Section 3.4);
   o  An OPTIONAL <fee:balance> element (as described in Section 3.5);
   o  An OPTIONAL <fee:creditLimit> element (as described in
      Section 3.6).

   Example <transfer> command:

   C: <?xml version="1.0" encoding="utf-8" standalone="no"?>
   C: <epp xmlns="urn:ietf:params:xml:ns:epp-1.0">
   C:   <command>
   C:     <transfer op="request">
   C:       <domain:transfer
   C:         xmlns:domain="urn:ietf:params:xml:ns:domain-1.0">
   C:         <domain:name>example.com</domain:name>
   C:         <domain:period unit="y">1</domain:period>
   C:         <domain:authInfo>
   C:           <domain:pw roid="JD1234-REP">2fooBAR</domain:pw>
   C:         </domain:authInfo>
   C:       </domain:transfer>
   C:     </transfer>
   C:     <extension>
   C:       <fee:transfer xmlns:fee="urn:ietf:params:xml:ns:fee-1.0">
   C:         <fee:currency>USD</fee:currency>
   C:         <fee:fee>5.00</fee:fee>
   C:       </fee:transfer>
   C:     </extension>
   C:     <clTRID>ABC-12345</clTRID>
   C:   </command>
   C: </epp>

















Carney, et al.          Expires September 6, 2018              [Page 23]

Internet-Draft           Registry Fee Extension               March 2018


   Example <transfer> response:

   S: <?xml version="1.0" encoding="utf-8" standalone="no"?>
   S: <epp xmlns="urn:ietf:params:xml:ns:epp-1.0">
   S:   <response>
   S:     <result code="1001">
   S:       <msg>Command completed successfully; action pending</msg>
   S:     </result>
   S:     <resData>
   S:       <domain:trnData
   S:         xmlns:domain="urn:ietf:params:xml:ns:domain-1.0">
   S:         <domain:name>example.com</domain:name>
   S:         <domain:trStatus>pending</domain:trStatus>
   S:         <domain:reID>ClientX</domain:reID>
   S:         <domain:reDate>2000-06-08T22:00:00.0Z</domain:reDate>
   S:         <domain:acID>ClientY</domain:acID>
   S:         <domain:acDate>2000-06-13T22:00:00.0Z</domain:acDate>
   S:         <domain:exDate>2002-09-08T22:00:00.0Z</domain:exDate>
   S:       </domain:trnData>
   S:     </resData>
   S:     <extension>
   S:       <fee:trnData xmlns:fee="urn:ietf:params:xml:ns:fee-1.0">
   S:         <fee:currency>USD</fee:currency>
   S:         <fee:fee
   S:           refundable="1"
   S:           grace-period="P5D">5.00</fee:fee>
   S:       </fee:trnData>
   S:     </extension>
   S:     <trID>
   S:       <clTRID>ABC-12345</clTRID>
   S:       <svTRID>54322-XYZ</svTRID>
   S:     </trID>
   S:   </response>
   S: </epp>

5.2.5.  EPP <update> Command

   This extension adds elements to both the EPP <update> command and
   response, when the extension is included in the <login> command
   service extensions.

   When submitting a <update> command to the server, the client MAY
   include in the <extension> element a <fee:update> element which
   includes the following child elements:

   o  An OPTIONAL <fee:currency> element (as described in Section 3.2);
   o  One or more <fee:fee> elements (as described in Section 3.4).




Carney, et al.          Expires September 6, 2018              [Page 24]

Internet-Draft           Registry Fee Extension               March 2018


   When the <update> command has been processed successfully, and the
   client included the extension in the <login> command service
   extensions, the server MAY include in the <extension> section of the
   EPP response a <fee:updData> element, which contains the following
   child elements:

   o  A <fee:currency> element (as described in Section 3.2);
   o  Zero or more <fee:fee> elements (as described in Section 3.4);
   o  Zero or more <fee:credit> elements (as described in Section 3.4);
   o  An OPTIONAL <fee:balance> element (as described in Section 3.5);
   o  An OPTIONAL <fee:creditLimit> element (as described in
      Section 3.6).

   Example <update> command:

   C: <?xml version="1.0" encoding="utf-8" standalone="no"?>
   C: <epp xmlns="urn:ietf:params:xml:ns:epp-1.0">
   C:   <command>
   C:     <update>
   C:       <domain:update
   C:         xmlns:domain="urn:ietf:params:xml:ns:domain-1.0">
   C:         <domain:name>example.com</domain:name>
   C:         <domain:chg>
   C:           <domain:registrant>sh8013</domain:registrant>
   C:         </domain:chg>
   C:       </domain:update>
   C:     </update>
   C:     <extension>
   C:       <fee:update xmlns:fee="urn:ietf:params:xml:ns:fee-1.0">
   C:         <fee:currency>USD</fee:currency>
   C:         <fee:fee>5.00</fee:fee>
   C:       </fee:update>
   C:     </extension>
   C:     <clTRID>ABC-12345</clTRID>
   C:   </command>
   C: </epp>















Carney, et al.          Expires September 6, 2018              [Page 25]

Internet-Draft           Registry Fee Extension               March 2018


   Example <update> response:

   S: <?xml version="1.0" encoding="utf-8" standalone="no"?>
   S: <epp xmlns="urn:ietf:params:xml:ns:epp-1.0">
   S:   <response>
   S:     <result code="1000">
   S:       <msg>Command completed successfully</msg>
   S:     </result>
   S:     <extension>
   S:       <fee:updData xmlns:fee="urn:ietf:params:xml:ns:fee-1.0">
   S:         <fee:currency>USD</fee:currency>
   S:         <fee:fee>5.00</fee:fee>
   S:       </fee:updData>
   S:     </extension>
   S:     <trID>
   S:       <clTRID>ABC-12345</clTRID>
   S:       <svTRID>54321-XYZ</svTRID>
   S:     </trID>
   S:   </response>
   S: </epp>

6.  Formal Syntax

   One schema is presented here that is the EPP Fee Extension schema.

   The formal syntax presented here is a complete schema representation
   of the object mapping suitable for automated validation of EPP XML
   instances.  The BEGIN and END tags are not part of the schema; they
   are used to note the beginning and ending of the schema for URI
   registration purposes.

6.1.  Fee Extension Schema

   Copyright (c) 2018 IETF Trust and the persons identified as authors
   of the code.  All rights reserved.

   Redistribution and use in source and binary forms, with or without
   modification, are permitted provided that the following conditions
   are met:

   o  Redistributions of source code must retain the above copyright
      notice, this list of conditions and the following disclaimer.
   o  Redistributions in binary form must reproduce the above copyright
      notice, this list of conditions and the following disclaimer in
      the documentation and/or other materials provided with the
      distribution.
   o  Neither the name of Internet Society, IETF or IETF Trust, nor the
      names of specific contributors, may be used to endorse or promote



Carney, et al.          Expires September 6, 2018              [Page 26]

Internet-Draft           Registry Fee Extension               March 2018


      products derived from this software without specific prior written
      permission.

   THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
   "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
   LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
   A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE COPYRIGHT
   OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
   SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
   LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
   DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
   THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
   (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
   OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

  BEGIN
  <?xml version="1.0" encoding="utf-8"?>
  <schema xmlns="http://www.w3.org/2001/XMLSchema"
    xmlns:fee="urn:ietf:params:xml:ns:fee-1.0"
    xmlns:eppcom="urn:ietf:params:xml:ns:eppcom-1.0"
    xmlns:domain="urn:ietf:params:xml:ns:domain-1.0"
    targetNamespace="urn:ietf:params:xml:ns:fee-1.0"
    elementFormDefault="qualified">

    <import namespace="urn:ietf:params:xml:ns:eppcom-1.0" />
    <import namespace="urn:ietf:params:xml:ns:domain-1.0" />

    <annotation>
      <documentation>
        Extensible Provisioning Protocol v1.0 Fee Extension
      </documentation>
    </annotation>

    <!-- Child elements found in EPP commands and responses -->
    <element name="check" type="fee:checkType" />
    <element name="chkData" type="fee:chkDataType" />
    <element name="create" type="fee:transformCommandType" />
    <element name="creData" type="fee:transformResultType" />
    <element name="renew" type="fee:transformCommandType" />
    <element name="renData" type="fee:transformResultType" />
    <element name="transfer" type="fee:transformCommandType" />
    <element name="trnData" type="fee:transformResultType" />
    <element name="update" type="fee:transformCommandType" />
    <element name="updData" type="fee:transformResultType" />
    <element name="delData" type="fee:transformResultType" />

    <!-- client <check> command -->
    <complexType name="checkType">



Carney, et al.          Expires September 6, 2018              [Page 27]

Internet-Draft           Registry Fee Extension               March 2018


      <sequence>
        <element name="currency" type="fee:currencyType"
          minOccurs="0" />
        <element name="command" type="fee:commandType"
          minOccurs="1" maxOccurs="unbounded" />
      </sequence>
    </complexType>

    <complexType name="objectIdentifierType">
      <simpleContent>
        <extension base="eppcom:labelType">
          <attribute name="element"
          type="NMTOKEN" default="name" />
        </extension>
      </simpleContent>
    </complexType>

    <!-- server <check> result -->
    <complexType name="chkDataType">
      <sequence>
        <element name="currency" type="fee:currencyType" />
        <element name="cd" type="fee:objectCDType"
          maxOccurs="unbounded" />
      </sequence>
    </complexType>

    <complexType name="objectCDType">
      <sequence>
        <element name="objID" type="fee:objectIdentifierType" />
        <element name="class" type="token" minOccurs="0" />
        <element name="command" type="fee:commandDataType"
          minOccurs="0" maxOccurs="unbounded" />
        <element name="reason" type="fee:reasonType" minOccurs="0" />
      </sequence>
      <attribute name="avail" type="boolean" default="1" />
    </complexType>

    <!-- general transform (create, renew, update, transfer) command -->
    <complexType name="transformCommandType">
      <sequence>
        <element name="currency" type="fee:currencyType"
          minOccurs="0" />
        <element name="fee" type="fee:feeType"
          maxOccurs="unbounded" />
        <element name="credit" type="fee:creditType"
          minOccurs="0" maxOccurs="unbounded" />
      </sequence>
    </complexType>



Carney, et al.          Expires September 6, 2018              [Page 28]

Internet-Draft           Registry Fee Extension               March 2018


    <!-- general transform (create, renew, update) result -->
    <complexType name="transformResultType">
      <sequence>
        <element name="currency" type="fee:currencyType"
          minOccurs="0" />
        <element name="period" type="domain:periodType"
          minOccurs="0" />
        <element name="fee" type="fee:feeType"
          minOccurs="0" maxOccurs="unbounded" />
        <element name="credit" type="fee:creditType"
          minOccurs="0" maxOccurs="unbounded" />
        <element name="balance" type="fee:balanceType"
          minOccurs="0" />
        <element name="creditLimit" type="fee:creditLimitType"
          minOccurs="0" />
      </sequence>
    </complexType>

    <!-- common types -->
    <simpleType name="currencyType">
      <restriction base="string">
        <pattern value="[A-Z]{3}" />
      </restriction>
    </simpleType>

    <complexType name="commandType">
      <sequence>
        <element name="period" type="domain:periodType"
          minOccurs="0" maxOccurs="1" />
      </sequence>
      <attribute name="name" type="fee:commandEnum"/>
      <attribute name="customName" type="token"/>
      <attribute name="phase" type="token" />
      <attribute name="subphase" type="token" />
      <attribute name="standard" type="boolean" default="0" />
    </complexType>

    <complexType name="commandDataType">
      <complexContent>
        <extension base="fee:commandType">
          <sequence>
            <element name="fee" type="fee:feeType"
              minOccurs="0" maxOccurs="unbounded" />
            <element name="credit" type="fee:creditType"
              minOccurs="0" maxOccurs="unbounded" />
            <element name="reason" type="fee:reasonType"
              minOccurs="0" />
          </sequence>



Carney, et al.          Expires September 6, 2018              [Page 29]

Internet-Draft           Registry Fee Extension               March 2018


        </extension>
      </complexContent>
    </complexType>

    <complexType name="reasonType">
      <simpleContent>
        <extension base="token">
          <attribute name="lang" type="language" default="en"/>
        </extension>
      </simpleContent>
    </complexType>

    <simpleType name="commandEnum">
      <restriction base="token">
        <enumeration value="create"/>
        <enumeration value="delete"/>
        <enumeration value="renew"/>
        <enumeration value="update"/>
        <enumeration value="transfer"/>
        <enumeration value="restore"/>
        <enumeration value="custom"/>
      </restriction>
    </simpleType>

    <simpleType name="nonNegativeDecimal">
      <restriction base="decimal">
        <minInclusive value="0" />
      </restriction>
    </simpleType>

    <simpleType name="negativeDecimal">
      <restriction base="decimal">
        <maxInclusive value="0" />
      </restriction>
    </simpleType>

    <complexType name="feeType">
      <simpleContent>
        <extension base="fee:nonNegativeDecimal">
          <attribute name="description"/>
          <attribute name="refundable" type="boolean" />
          <attribute name="grace-period" type="duration" />
          <attribute name="applied">
            <simpleType>
              <restriction base="token">
                <enumeration value="immediate" />
                <enumeration value="delayed" />
              </restriction>



Carney, et al.          Expires September 6, 2018              [Page 30]

Internet-Draft           Registry Fee Extension               March 2018


            </simpleType>
          </attribute>
        </extension>
      </simpleContent>
    </complexType>

    <complexType name="creditType">
      <simpleContent>
        <extension base="fee:negativeDecimal">
          <attribute name="description"/>
        </extension>
      </simpleContent>
    </complexType>

    <simpleType name="balanceType">
      <restriction base="decimal" />
    </simpleType>

    <simpleType name="creditLimitType">
      <restriction base="decimal" />
    </simpleType>

  </schema>
  END

7.  Security Considerations

   The mapping extensions described in this document do not provide any
   security services beyond those described by EPP [RFC5730], the EPP
   domain name mapping [RFC5731], and protocol layers used by EPP.  The
   security considerations described in these other specifications apply
   to this specification as well.

8.  IANA Considerations

8.1.  XML Namespace

   This document uses URNs to describe XML namespaces and XML schemas
   conforming to a registry mechanism described in [RFC3688].

   Registration request for the fee namespace:

   URI: urn:ietf:params:xml:ns:fee-1.0

   Registrant Contact: IESG.

   XML: None.  Namespace URIs do not represent an XML specification.




Carney, et al.          Expires September 6, 2018              [Page 31]

Internet-Draft           Registry Fee Extension               March 2018


   Registration request for the fee schema:

   URI: urn:ietf:params:xml:schema:fee-1.0

   Registrant Contact: IESG.

   XML: See the "Formal Syntax" section of this document.

8.2.  EPP Extension Registry

   The EPP extension described in this document should be registered by
   the IANA in the EPP Extension Registry described in [RFC7451].  The
   details of the registration are as follows:

   Name of Extension: Registry Fee Extension for the Extensible
   Provisioning Protocol (EPP)

   Document status: Standards Track

   Reference: (insert reference to RFC version of this document)

   Registrant Name and Email Address: IESG, <iesg@ietf.org>.

   TLDs: any

   IPR Disclosure: none

   Status: active

   Notes: none

9.  Implementation Status

   Note to RFC Editor: Please remove this section and the reference to
   [RFC6982] before publication.

   This section records the status of known implementations of the
   protocol defined by this specification at the time of posting of this
   Internet-Draft, and is based on a proposal described in [RFC6982].
   The description of implementations in this section is intended to
   assist the IETF in its decision processes in progressing drafts to
   RFCs.  Please note that the listing of any individual implementation
   here does not imply endorsement by the IETF.  Furthermore, no effort
   has been spent to verify the information presented here that was
   supplied by IETF contributors.  This is not intended as, and must not
   be construed to be, a catalog of available implementations or their
   features.  Readers are advised to note that other implementations may
   exist.



Carney, et al.          Expires September 6, 2018              [Page 32]

Internet-Draft           Registry Fee Extension               March 2018


   According to [RFC6982], "this will allow reviewers and working groups
   to assign due consideration to documents that have the benefit of
   running code, which may serve as evidence of valuable experimentation
   and feedback that have made the implemented protocols more mature.
   It is up to the individual working groups to use this information as
   they see fit".

9.1.  RegistryEngine EPP Service

   Organization: CentralNic

   Name: RegistryEngine EPP Service

   Description: Generic high-volume EPP service for gTLDs, ccTLDs and
   SLDs

   Level of maturity: Deployed in CentralNic's production environment as
   well as two other gTLD registry systems, and two ccTLD registry
   systems.

   Coverage: All aspects of the protocol are implemented.

   Licensing: Proprietary In-House software

   Contact: epp@centralnic.com

   URL: https://www.centralnic.com

10.  Acknowledgements

   The authors wish to thank the following persons for their feedback
   and suggestions:

   o  James Gould of Verisign Inc
   o  Luis Munoz of ISC
   o  Michael Young of Architelos
   o  Ben Levac and Jeff Eckhaus of Demand Media
   o  Seth Goldman of Google
   o  Klaus Malorny and Michael Bauland of Knipp
   o  Jody Kolker, Joe Snitker and Kevin Allendorf of Go Daddy
   o  Michael Holloway of Com Laude
   o  Santosh Kalsangrah of Impetus Infotech
   o  Alex Mayrhofer of Nic.at
   o  Thomas Corte of Knipp Medien und Kommunikation GmbH







Carney, et al.          Expires September 6, 2018              [Page 33]

Internet-Draft           Registry Fee Extension               March 2018


11.  Change History

11.1.  Change from 09 to 10

   Updated document per Working Group Last Call comments.  Updated
   schema to version 1.0 in anticipation of standardization, no changes
   were made to the latest, 0.25, schema.  Made minor textual changes
   throughout for enhanced clarity per WGLC comments.

11.2.  Change from 08 to 09

   Updated scheme to version 0.25 to allow tighter checking on
   <fee:command> by splitting the client and server definitions, moved
   the class element from the command to the object level and added an
   optional standard attribute to the command element.  Also updated
   section 3.1 for clarity on name attribute; updated section 3.9 for
   clarity on uses of <fee:reason>; removed second paragraph in section
   5.2.1 as it was duplicative of second to last paragraph in 4.0; and
   updated section 5.1.1 to add section references.

11.3.  Change from 07 to 08

   Updated section 3.8 and 5.1.1 to provide clarity on server processing
   and response of various scenarios (i.e. "quiet" period processing).

11.4.  Change from 06 to 07

   Updated section 3.8 and 4.0 to provide clarity on server processing
   and response of various scenarios.

11.5.  Change from 05 to 06

   Updated scheme to version 0.23 to allow the return of no
   <fee:command> element(s) if an error situation occurs.  Edited
   section 3.8 extensively after input from interim meeting and REGEXT
   F2F meeting at IETF-99.  Added normative reference for draft-ietf-
   eppext-launchphase.

11.6.  Change from 04 to 05

   Updated scheme to version 0.21 to support the lang attribute for the
   reason element of the objectCDType and the commandType types as well
   as to add the update command to the commandEnum type.  Updated
   section 3.1 to include language for the custom command.  Added
   section 3.9 to provide a description of the <fee:reason> element.
   Fixed typos and added clarification text on when client fee is less
   than server fee in section 4.  Additionally, I added description




Carney, et al.          Expires September 6, 2018              [Page 34]

Internet-Draft           Registry Fee Extension               March 2018


   pointers to appropriate Section 3 definitions for element clarity
   throughout the document.

11.7.  Change from 03 to 04

   Updated scheme to version 0.19 to correct typos and to replace the
   commandTypeValue type with the commandEnum type and customName
   attribute for stricter validation.  Updated various text for grammar
   and clarity.  Added text to section 4 clarifying the <check> response
   when the client provided no fee extension but the server was
   expecting the extension.

11.8.  Change from 02 to 03

   Updated scheme to version 0.17 to simplify the check command syntax.
   Moved fee avail to objectCDType to allow fast failing on error
   situations.  Removed the objectCheckType as it was no longer being
   used.  Updated examples to reflect these scheme changes.  Added
   language for server failing a <create> if the <fee:fee> passed by the
   client is less than the server fee.

11.9.  Change from 01 to 02

   Updated scheme to version 0.15 to fix errors in CommandType,
   objectCDType, transformCommandType and transformResultType
   definitions.

11.10.  Change from 00 to 01

   Added Roger Carney as author to finish draft.  Moved Formal Syntax
   section to main level numbering.  Various grammar, typos, and
   administrative edits for clarity.  Removed default value for the
   "applied" attribute of <fee:fee> so that it can truly be optional.
   Added support for the <delete> command to return a <fee:fee> element
   as well.  Modified default response on the <check> command for the
   optional <fee:period> when it was not provided in the command,
   leaving it to the server to provide the default period value.
   Extensive edits were done to the <check> command, the <check>
   response and to the fee extension schema (checkType, objectCheckType,
   objectIdentifierType, objectCDType, commandType) to support
   requesting and returning multiple transformation fees in a single
   call.  Added section on Phase/Subphase to provide more context on the
   uses.








Carney, et al.          Expires September 6, 2018              [Page 35]

Internet-Draft           Registry Fee Extension               March 2018


11.11.  Change from draft-brown-00 to draft-ietf-regext-fees-00

   Updated to be REGEXT WG document.

12.  Normative References

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119,
              DOI 10.17487/RFC2119, March 1997,
              <https://www.rfc-editor.org/info/rfc2119>.

   [RFC3688]  Mealling, M., "The IETF XML Registry", BCP 81, RFC 3688,
              DOI 10.17487/RFC3688, January 2004,
              <https://www.rfc-editor.org/info/rfc3688>.

   [RFC3915]  Hollenbeck, S., "Domain Registry Grace Period Mapping for
              the Extensible Provisioning Protocol (EPP)", RFC 3915,
              DOI 10.17487/RFC3915, September 2004,
              <https://www.rfc-editor.org/info/rfc3915>.

   [RFC5730]  Hollenbeck, S., "Extensible Provisioning Protocol (EPP)",
              STD 69, RFC 5730, DOI 10.17487/RFC5730, August 2009,
              <https://www.rfc-editor.org/info/rfc5730>.

   [RFC5731]  Hollenbeck, S., "Extensible Provisioning Protocol (EPP)
              Domain Name Mapping", STD 69, RFC 5731,
              DOI 10.17487/RFC5731, August 2009,
              <https://www.rfc-editor.org/info/rfc5731>.

   [RFC6982]  Sheffer, Y. and A. Farrel, "Improving Awareness of Running
              Code: The Implementation Status Section", RFC 6982,
              DOI 10.17487/RFC6982, July 2013,
              <https://www.rfc-editor.org/info/rfc6982>.

   [RFC7451]  Hollenbeck, S., "Extension Registry for the Extensible
              Provisioning Protocol", RFC 7451, DOI 10.17487/RFC7451,
              February 2015, <https://www.rfc-editor.org/info/rfc7451>.

   [RFC8334]  Gould, J., Tan, W., and G. Brown, "Launch Phase Mapping
              for the Extensible Provisioning Protocol (EPP)", RFC 8334,
              DOI 10.17487/RFC8334, March 2018,
              <https://www.rfc-editor.org/info/rfc8334>.

Authors' Addresses







Carney, et al.          Expires September 6, 2018              [Page 36]

Internet-Draft           Registry Fee Extension               March 2018


   Roger Carney
   GoDaddy Inc.
   14455 N. Hayden Rd. #219
   Scottsdale, AZ  85260
   US

   Email: rcarney@godaddy.com
   URI:   http://www.godaddy.com


   Gavin Brown
   CentralNic Group plc
   35-39 Moorgate
   London, England  EC2R 6AR
   GB

   Phone: +44 20 33 88 0600
   Email: gavin.brown@centralnic.com
   URI:   http://www.centralnic.com


   Jothan Frakes

   Email: jothan@jothan.com
   URI:   http://jothan.com


























Carney, et al.          Expires September 6, 2018              [Page 37]
